# Count Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCProductWrapper..::..Count Property
IFCProductWrapper Class See Also
---
The number of objects associated with the IfcProduct in this wrapper.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int Count { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Count As Integer
	Get
```

Visual C++
---
```text
public:
property int Count {
	int get ();
}
```

# See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace